The `terraform plan` does not invoke the provider's resource operations (like create, read, or update). It compares the local state with the resource config to determine if there are any differences and what actions, if any, are needed to reconcile them.

On `terraform apply` the missing file is correctly detected:
```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # proxmox_virtual_environment_file.test will be created
  + resource "proxmox_virtual_environment_file" "test" {
      + content_type           = "iso"
      + datastore_id           = "local"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "./some/path/to/non-existing.file"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
proxmox_virtual_environment_file.test: Creating...
╷
│ Error: open ./some/path/to/non-existing.file: no such file or directory
│ 
│   with proxmox_virtual_environment_file.test,
│   on main.tf line 200, in resource "proxmox_virtual_environment_file" "test":
│  200: resource "proxmox_virtual_environment_file" "test" {
│ 
╵
```